app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Beatles"], ["updated_at", "2020-10-13 20:01:33.976667"], ["id", 5]]

  def destroy
    @band = Band.find(params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]