app/controllers/users_controller.rb

  def show
    @user = User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "wcgxenFSBGuTYcCCXr-K0w"], ["LIMIT", 1]]